<template lang="pug">
  .about-us-agreement
    yfb-appbar(title="服务协议")
    .scroll-content
      .top-title 收费服务协议
      p.p-title 尊敬的乙方宝用户：
      p 欢迎您使用乙方宝收费会员服务。乙方宝提供的网络服务采用收费与免费结合的方式。您须先成为乙方宝普通关注用户之后，才能继续进行购买服务。通过购买程序支付费用后，您就可以轻松享受乙方宝收费会员服务。在开始购买程序之前，请您首先同意并接受以下服务条款。
      p 【注意】乙方宝有责任提醒您，请仔细阅读以下全部内容，当您确认接受本服务协议或开始使用本协议项下乙方宝服务时，即表示用户与乙方宝（北京千里马网信技术有限公司）已达成协议关系，并自愿接受并遵守乙方宝服务的所有服务协议及相关之子协议、管理规范等。
      .p-title 一、协议条款的确认和接受
      p 1.1、在您决定购买相关收费会员之前，请仔细阅读本收费协议条款。您必须在完全同意以下条款的前提下，才能进行购买程序。乙方宝将根据以下收费协议条款为您提供收费服务。您在享受乙方宝收费服务时必须完全、严格遵守本收费协议条款。
      p 1.2、乙方宝根据互联网的发展和中华人民共和国有关法律、法规的变化，不断地完善服务质量并依此修改服务条款。乙方宝有权就本协议随时更新，且毋须另行通知。您的权利以及义务的表述、购买程序及收费标准，均以最新的服务条款为准。您如果不同意该条款的修改并不影响已发生责任及义务的承担；如果您在条款变更后继续访问或使用乙方宝，则视为您已经接受对本协议的修改。
      p 1.3、您在进行缴费程序过程中点击"开通会员"按钮即表示您已仔细阅读并完全接受本收费协议下的全部条款。只有您根据提示确认其愿意支付相关费用，并通过本协议约定方式中的一种方式支付费用后，您才能使用该收费服务。如您拒绝支付该等费用，则不能使用相关的服务。
      .p-title 二、风险及责任
      p 2.1、您须对其自身在使用乙方宝所提供的服务时的一切行为、行动（不论是否故意）负全部责任。
      p 2.2、您明确了解并同意，本协议第5.2条款约定的付费方式为代收费运营商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均会给您造成相应的经济损失。为此，您同意乙方宝在充分履行其在本协议项下全部义务及勤勉谨慎义务的前提下不对您的前述风险和损失承担任何责任；并且，乙方宝不承担向不法分子追究侵权责任或者代其向您承担损失的任何责任和义务。
      p 2.3、您对本服务条款及修改有任何异议，可自动放弃其资格，但不退还任何已缴纳的收费费用。
      .p-title 三、收费标准
      p 3.1、一旦您购买了乙方宝的任何收费服务，即视为您认可该项服务标明之价格；您购买成功后，该项服务即时生效。
      p 3.2、收费费用标准：具体每项服务的收费标准以“开通会员”页面的具体标价为准。
      .p-title 四、购买步骤
      p 4.1、对于具体购买操作步骤，乙方宝会在相关页面上做每一步的明确提示。
      p 4.2、费用支付：收费费用将在您开通会员之日按照开通会员上的标示价格通过微信支付第三方代收费的方式支付。
      p 4.3、一旦您在乙方宝购买收费服务成功后，则乙方宝将即时收取该收费服务的费用，并不提供退费服务。
      .p-title 五、查看信息服务周期及查看信息权限
      p 5.1、每一个收费会员都有自己单独的查看信息服务周期，您一旦购买这个收费服务即视为认可它的查看服务周期。
      p 5.2、每一个收费服务的查看信息服务周期以开通会员时选择的购买时间为准。如您未在有效时间内查看已购买的服务信息，视为您已全部查看，乙方宝概不退款。
      p 5.3、您查看信息权限：您的查看信息服务周期不会因其在查看期间对信息的中断、终止、等情况而延长。
      .p-title 六、到期日期查询
      p 6.1、您可通过微信进入乙方宝，进入"个人中心"页面，免费查询会员服务到期详情。
      .p-title 七、用户权利限制
      p 7.1、对于您购买的收费服务，您只可以私人查看，不得用于盈利等用途。
      p 7.2、您同意不会采用收费或免费的方式，全部或部分地在任何公开场合展示您购买的收费服务信息，除非您的上述行为不会构成侵权。
      p 7.3、当您购买、使用收费信息时，禁止有下列情况发生：
      p 7.3.1、用非法的方式或为了非法的目的使用已购买的收费服务信息；
      p 7.3.2、将您的乙方宝账户有偿或无偿提供给任何第三人，并允许他通过您的账户查看非他付费购买的收费服务信息。
      p 7.3.3、将收费服务信息复制、销售、出租或授权给任何第三方。
      p 7.3.4、主动对乙方宝用于保护其收费服务信息的任何安全措施技术进行攻克、反向操作、更改、破坏或其他篡改，或协助他人进行上述行为。
      .p-title 八、变更及免责条款
      p 8.1、乙方宝对收费会员的查看信息服务周期、购买价格保留随时变更的权利，而不需通知您。对于所有服务的中断或终止而造成的任何损失，乙方宝无需对您或任何第三方承担任何责任。
      p 8.2、鉴于网络服务的特殊性，您同意乙方宝有权随时变更、中断或终止部分或全部的网络服务。乙方宝保留随时修改或中断服务而不需通知您的权利，对于所有服务的中断或终止而造成的任何损失，乙方宝无需对您或任何第三方承担任何责任。
      p 8.3、对于因服务器的死机、网络的故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗拒的事由，包括但不限于政府行为、自然灾害、黑客攻击等造成的服务中断和对您个人数据及资料造成的损失，乙方宝不承担由此对您造成的任何损失或退还任何已缴纳的收费服务费用。但乙方宝应尽可能事先进行通告。
      p 8.4、您购买的服务使用期限中包含解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间乙方宝不予补偿。
      p 8.5、乙方宝对任何直接、间接、偶然、特殊及继起的损害不负责任，不予赔偿
      p 8.6、您在使用乙方宝所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，不论原因如何，乙方宝均不负责任。由于您与他人共享微信账号，由此导致的任何个人资料泄露，本服务号不负任何责任。
      .p-title 九、中断及终止服务
      p 9.1、如您违反本服务条款中的内容，乙方宝有权在不通知您的情况下立即终止您已购买的所有服务，以及取消您的乙方宝账户和使用权限，但不退还任何已缴纳的收费服务费用。
</template>

<script>
import {YfbAppbar} from 'yfb'
export default {

  components: {
    YfbAppbar
  }
}
</script>

<style lang="scss">
.about-us-agreement {
  z-index: 2;
  font-size: 16px;
  p {
    line-height: 1.8;
    text-indent: 1em;
  }
  .p-title {
    text-indent: 0;
    margin-top: .5em;
    margin-bottom: 1em;
    font-weight: 500;
  }
  .scroll-content {
    top: 40px;
    padding: 10px;
    .top-title {
      font-size: 18px;
    }
  }
}
</style>
